const places = [
// 카페
{ id: 1, name: "블루포트 공학관점", building: ["공학관", "공대"], type: "카페", time: "09:00 - 19:00", lat: 35.85910891900613, lng: 128.48747324155707 },
{ id: 2, name: "카페사월", building: ["행소박물관"], type: "카페", time: "09:00 - 18:00", lat: 35.85672754000742, lng: 128.4898419543818 },
{ id: 3, name: "카페ING 동산도서관점", building: ["도서관"], type: "카페", time: "08:40 - 18:00", lat: 35.85639335738497, lng: 128.48772138401628 },
{ id: 4, name: "피피커피", building: ["의양관"], type: "카페", time: "08:30 - 19:00", lat: 35.85625408418409, lng: 128.48513954036963 },
{ id: 5, name: "붐카페&코너베이커리", building: ["구바우어관"], type: "카페", time: "09:00 - 19:00", lat: 35.85423022055133, lng: 128.4861118722504 },
{ id: 6, name: "카페ING 동영관점", building: ["동영관"], type: "카페", time: "08:30 - 16:15", lat: 35.85320516540829, lng: 128.48428844646253 },
{ id: 7, name: "이디야커피 계명대명교생활관점", building: ["명교생활관", "기숙사"], type: "카페", time: "07:50 - 21:00", lat: 35.85705832685428, lng: 128.4802146357763 },

// 서점
{ id: 8, name: "계명대 구내서점", building: ["구바우어관"], type: "서점", time: "09:00 - 19:00", lat: 35.85423022055133, lng: 128.4861118722504 },

// 도서관
{ id: 9, name: "동산도서관", building: ["도서관"], type: "도서관", time: "09:00 - 19:00", lat: 35.85640495369977, lng: 128.48714874254276 },
{ id: 10, name: "의학도서관", building: ["의대"], type: "도서관", time: "08:30 - 22:00", lat: 35.85509916572842, lng: 128.4805102964029 },

// 프린트
{ id: 11, name: "동산도서관 3F", building: ["도서관"], type: "프린트", time: "09:00 - 19:00", lat: 35.85640495369977, lng: 128.48714874254276 },
{ id: 12, name: "공대 1호관 2F", building: ["공학관", "공대"], type: "프린트", time: "09:00 - 19:00", lat: 35.85913509095088, lng: 128.48754291875463 },
{ id: 13, name: "구바 지하 1층", building: ["구바우어관"], type: "프린트", time: "09:00 - 19:00", lat: 35.85639335738497, lng: 128.48772138401628 },
{ id: 14, name: "의양관 지하 1층", building: ["의양관"], type: "프린트", time: "09:00 - 19:00", lat: 35.856267774531446, lng: 128.4849433084449 },
{ id: 15, name: "음대 1F", building: ["음대"], type: "프린트", time: "09:00 - 19:00", lat: 35.85829876580757, lng: 128.4904912789133 },

// 학식당
{ id: 16, name: "구바우어관 지하 1층", building: ["구바우어관"], type: "학식당", time: "09:00 - 19:00", lat: 35.85423022055133, lng: 128.4861118722504 },
{ id: 17, name: "신바우어관 2F", building: ["신바우어관"], type: "학식당", time: "09:00 - 19:00", lat: 35.85393360912969, lng: 128.48550305451363 },
{ id: 18, name: "공대학식당", building: ["공학관", "공대"], type: "학식당", time: "09:00 - 19:00", lat: 35.858219287991645, lng: 128.4894519809646 },
{ id: 19, name: "아람관 3F", building: ["아람관"], type: "학식당", time: "09:00 - 19:00", lat: 35.853956594358515, lng: 128.48291324663953 },

// 편의점
{ id: 20, name: "CU 계명대명교생활관점", building: ["명교생활관", "기숙사"], type: "편의점", time: "00:00 - 24:00", lat: 35.85705832685428, lng: 128.4802146357763 },
{ id: 21, name: "이마트24 계명대공학관점", building: ["공학관", "공대"], type: "편의점", time: "08:30 - 20:00", lat: 35.858219287991645, lng: 128.4894519809646 },
{ id: 22, name: "CU 계명대의과대학점", building: ["의대"], type: "편의점", time: "09:00 - 18:00", lat: 35.85509916572842, lng: 128.4805102964029 },
{ id: 23, name: "이마트24 R계명대바우어점", building: ["구바우어관"], type: "편의점", time: "00:00 - 24:00", lat: 35.85423022055133, lng: 128.4861118722504 },

// 기타
{ id: 24, name: "계명항공여행사", building: ["구바우어관"], type: "기타", time: "10:00 - 17:00", lat: 35.85423022055133, lng: 128.4861118722504 },
{ id: 25, name: "신바우어관 북카페", building: ["신바우어관, 북카페"], type: "기타", time: "10:00 - 18:00", lat: 35.85393360912969, lng: 128.48550305451363 },
{ id: 26, name: "문구점 (구바 B1F)", building: ["구바우어관, 문구점"], type: "기타", time: "08:30 - 18:30", lat: 35.85423022055133, lng: 128.4861118722504 },
{ id: 27, name: "우편 취급국 (구바 1F)", building: ["구바우어관, 우체국, 우편집중국"], type: "기타", time: "00:00 - 24:00", lat: 35.85423022055133, lng: 128.4861118722504 },
{ id: 28, name: "안경점 (구바 B1F)", building: ["구바우어관, 안경점"], type: "기타", time: "10:00 - 16:00", lat: 35.85423022055133, lng: 128.4861118722504 },


// 건물명 검색용
{ id: 101, name: "영암관", building: ["영암관", "인문국제학대학", "인국대", "사범대"], type: "건물", time: "", lat: 35.85415461789027 , lng:  128.48402664390682 },
{ id: 102, name: "의양관", building: ["의양관", "경영대학"], type: "건물", time: "", lat: 35.85625579439296, lng: 128.4850012009452 },
{ id: 103, name: "봉경관", building: ["봉경관", "사회과학대학", "사과대"], type: "건물", time: "", lat: 35.85523851809555 , lng: 128.48564639989385 },
{ id: 104, name: "쉐턱관", building: ["쉐턱관","사회과학대학(법학, 경찰행정)", "사과대", "인국대"], type: "건물", time: "", lat: 35.859301098309516, lng:  128.49014473257003},
{ id: 105, name: "동영관", building: ["동영관","Keimyung Adams College"], type: "건물", time: "", lat: 35.85325485066771 , lng: 128.48446094669262 },
{ id: 106, name: "백은관", building: ["백은관","자연과학대", "자과대"], type: "건물", time: "", lat: 35.85373347568502, lng: 128.48237222708735 },
{ id: 107, name: "보산관", building: ["보산관", "약학대학"], type: "건물", time: "", lat: 35.854771210581035, lng: 128.48225871445842 },
{ id: 108, name: "공학 1호관", building: ["공학 1호관", "공과대학"], type: "건물", time: "", lat: 35.859143003990205, lng: 128.4876316274582 },
{ id: 109, name: "공학 2호관", building: ["공학 2호관", "공과대학"], type: "건물", time: "", lat: 35.85924712716237, lng: 128.48686420006183 },
{ id: 110, name: "공학 3호관", building: ["공학 3호관", "공과대학"], type: "건물", time: "", lat: 35.85981413554627 , lng: 128.4871044977509 },
{ id: 111, name: "공학 4호관", building: ["공학 4호관", "공과대학"], type: "건물", time: "", lat: 35.859716674456436 , lng: 128.4876976993838 },
{ id: 114, name: "공학 7호관", building: ["공학 7호관", "공과대학", "덕래관" ], type: "건물", time: "", lat: 35.859458496725146 , lng: 128.48635061868276 },
{ id: 115, name: "의과대", building: ["의과대", "의과대힉"], type: "건물", time: "", lat: 35.85510670712482 , lng: 128.48044678670857 },
{ id: 116, name: "전갑규관", building: ["전갑규관", "간호대학", "인문국제학대학", "인국대"], type: "건물", time: "", lat: 35.855309336711976 , lng: 128.4793602007468  },
{ id: 117, name: "스미스관", building: ["스미스관", "Tabula Rasa College"], type: "건물", time: "", lat: 35.85642830201197 , lng: 128.48362070233372 },
{ id: 118, name: "체육관", building: ["체육관", "인문국제학대학", "인국대"], type: "건물", time: "", lat: 35.85443051705646 , lng: 128.48994840717393 },
{ id: 119, name: "음대", building: ["음악공연예술대학", "음대"], type: "건물", time: "", lat: 35.852872096471415, lng: 128.49062767449203 },
{ id: 120, name: "구바우어관", building: ["구바우어관"], type: "건물", time: "", lat: 35.85425659878625 , lng: 128.48616494439423  },
{ id: 121, name: "신바우어관", building: ["신바우어관"], type: "건물", time: "", lat: 35.853896173955235, lng: 128.48543317244648 },
{ id: 122, name: "여농관", building: ["여농관", "공대 학생회관"], type: "건물", time: "", lat: 35.85820150914234 , lng: 128.48943227586744 },
{ id: 123, name: "행소박물관", building: ["행소박물관"], type: "건물", time: "", lat: 35.85669535477981 , lng: 128.48989393341768 },

];

export default places;